{
  "nav": {
    "projetos": "PROJECTS",
    "pesquisa": "RESEARCH",
    "noticias": "NEWS",
    "equipe": "TEAM",
    "sobre": "ABOUT",
    "sistemas": "APLICATIONS",
    "contato": "CONTACT"
  },

  "footer": {
    "paginas": "pages",
    "parcerias": "partnerships",
    "contato": "contacts",
    "sistemas": "aplications"
  },

  "home": {
    "labSection": {
      "topTitle": "Learn more about our laboratory.",
      "topSubtitle": "MackLEAPS stands for Laboratory of Studies in Software Production Environment at Mackenzie Presbyterian University",
      "saibaMais": "Find Out More"
    },
    "projectSession": {
      "projetosTitle": "Projects",
      "projetosSubtitle": "Check out the main projects currently in development at the lab.",
      "saibaMais": "Find Out More",
      "projetosHome": [
        {
          "img": "/cloud.jpeg",
          "status": "In Progress",
          "title": "Estação Meteorológica",
          "description": "Application that communicates with a weather station and its sensors, collecting and manipulating real-time weather data."
        },
        {
          "img": "/minimalist_setup.jpeg",
          "status": "In Progress",
          "title": "Site Mackleaps",
          "description": "Its scope includes disseminating research and projects related to technology and recruiting potential members and partners."
        },
        {
          "img": "/camera.jpeg",
          "status": "In Progress",
          "title": "Contador de gente",
          "description": "It aims to count the number of people entering the buildings on the Higienópolis campus of Mackenzie University."
        },
        {
          "img": "/minimalist_setup.jpeg",
          "status": "In Progress",
          "title": "Atlas",
          "description": "The Atlas of the Americas is a digital initiative aimed at providing a centralized and reliable resource for information related to border laws and regulations across the American continent."
        }
      ]
    },

    "pesquisaSection": {
      "pesquisa": "research",
      "saibaMais": "Find Out More",
      "pesquisaSubtext": "On the side, you can see some of the research conducted in our laboratory. Click 'learn more' for further details.",
      "pesquisaHome": [
        {
          "img": "/code.jpeg",
          "txt": "Proposal of a PSP model adapted to self-direction in phases applied to maturity development in beginner computer science students.",
          "url": ""
        },
        {
          "img": "/psp.jpeg",
          "txt": "Architecture model of the sustainability index platform Mackenzie-FIESP.",
          "url": ""
        }
      ]
    },

    "sobreButton": "About",
    "contatoButton": "Contact",
    "joinTitle": "Join Us!",
    "jointSubtext": "Students from FCI and other academic units can participate in our projects. Participation can be virtual or in person, and the affiliation can be voluntary or as a scholarship intern. Our projects provide affiliation to PIBIC/PIVIC programs and generate hours of Complementary Activities for participants."
  },

  "about": {
    "title": "About us",
    "subtitle": "The MackLEAPS (Laboratory for Studies in Software Production Environment at Mackenzie Presbyterian University) is a research and software development laboratory affiliated with the School of Computing and Informatics (FCI) at Mackenzie Presbyterian University.",
    "educacao": "Education",
    "educacaoText": "The FCI was founded in 1970 as the College of Technology, in response to the need to quickly supply various sectors of the job market with qualified professionals in technology-based higher education courses. In 1999, it was transformed into the School of Computing and Informatics.",
    "objetivos": "Mission",
    "objetivosText": "Identifying software and system requirements, defining software components and their external properties, identifying quality control criteria, preparing students for the market through real projects, and building secure and applicable software.",
    "parcerias": "Partnerships"
  },

  "systems": {
    "title": "Systems",
    "subtitle": "Get to know and access our systems.",
    "sistemas": [
      {
        "title": "Oriente 1.0",
        "description": "Oriente is a system for monitoring the process of TCC (Course Conclusion Work) at FCI/Mackenzie, where students and professors interact digitally and manage activities involved in this context. The system allows for the registration of TCC projects, establishes links between students and advisors, manages the scheduling of panels and poster sessions, and allows for the recording of evaluations and comments. Oriente 1.0 enables better visualization and management of the TCC project registration process for coordinators, faculty, and students regarding TCC production at FCI.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha / Ivan Carlos Alcantara de Oliveira / Leandro Carlos Fernandes / Elisangela Botelho Gracias / Maria Amélia Eliseo - Coordinator / Alvaro Hibide Claver / Erika Borges Piaui / Gustavo Garabetti Munhoz / Jose Eduardo Bernardino Jorge / Lucas Ellery Viana",
        "link": ""
      },
      {
        "title": "Oriente 2.0",
        "description": "Oriente is a system for monitoring the process of TCC (Course Conclusion Work) at FCI/Mackenzie, where students and professors interact digitally throughout the process. In version 2.0, the MackLeaps Laboratory proposed a redesign of the interface, improving usability, responsiveness, and user experience. Additionally, improvements were made to the application architecture, such as refactoring, respecting design patterns and microservices orientation. New features were introduced such as scheduling panels, article evaluations, and documents for participation in evaluations.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Dirceu Matheus Junior / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha / Leandro Carlos Fernandes / Elisangela Botelho Gracias / Maria Amélia Eliseo - Coordinator / Ivan Carlos Alcantara de Oliveira / Luiz Carlos Machi Lozano / Thiago Graziani Traue.",
        "link": "https://mackleaps.mackenzie.br/oriente"
      },
      {
        "title": "GitBook",
        "description": "Students of the Software Residency Program - MackLeaps are encouraged to develop content during project execution, in the PBL modality. The content made available is used by new residents to help them tackle challenges throughout the program.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "",
        "link": "https://lab-mackleaps.gitbook.io/residencia-de-software-macklaeps-upm-fci/"
      },
      {
        "title": "Redmine",
        "description": "Redmine is a web-based project management system and bug tracking tool. It features a calendar and Gantt charts to aid in the visual representation of projects and their deadlines.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "",
        "link": "https://mackleaps.mackenzie.br/redmine"
      },
      {
        "title": "FCI Information Carousel",
        "description": "Project certified by coordinator Daniela Vieira Cunha on 08/05/2024. It aims to develop a digital communication platform for the dissemination of Events and Activities at the FCI Faculty of Computing and Informatics, comprising both the viewing and management modules. The information is presented through a carousel application displayed on a Smart TV located at the entrance of the FCI Building. The contents are viewed daily by more than 1300 people, including students, professors, and other academics who pass through the area. Among the information presented on this media are calls for lectures, training sessions, internal and external events, recruitment actions, dissemination of notices and research projects, as well as a dashboard with live data from the Mackenzie Weather Station project. The Carousel management module is provided by a web application hosted on MackCloud (on-premise cloud environment), allowing for the management of content with ease and agility.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Daniela Vieira Cunha - Coordinator / Ivan Carlos Alcantara de Oliveira / Leandro Carlos Fernandes / Maria Amélia Eliseo / Alvaro Hibide Claver / Erika Borges Piaui / Gustavo Garabetti Munhoz.",
        "link": "https://mackleaps.mackenzie.br/back-carrossel/"
      },
      {
        "title": "Mackleaps Website",
        "description": "The MackLeaps Laboratory (Laboratório de Estudos em Ambiente de Produção de Software) is the headquarters of the MackLeaps research group. Associated researchers develop software projects, of an applied nature, integrating knowledge from the areas of Software Engineering, Artificial Intelligence, and Human-Computer Interaction. Therefore, there is a need to record and disseminate information about the activities carried out by the group, such as completed or ongoing projects, research group activities, and its legacy. The aim of this project was the design and development of a bilingual website for the Laboratory, allowing to establish a visual identity for the group, as well as to present and manage the content related to MackLeaps.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Maria Amélia Eliseo - Coordinator / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha / Leandro Carlos Fernandes / Elisangela Botelho Gracias / Marcilyanne Moreira Gois / Ivan Carlos Alcantara de Oliveira / Alvaro Hibide Claver / Erika Borges Piaui / Gustavo Garabetti Munhoz / Jose Eduardo Bernardino Jorge / Lucas Ellery Viana / João Pedro Rodrigues Vieira / Pedro Henrique Araujo Farias.",
        "link": "https://mackleaps.mackenzie.br/"
      },
      {
        "title": "People Counter",
        "description": "Security is a point of interest for everyone living in social clusters. Understanding flows and behaviors of people moving in outdoor and indoor spaces can contribute to more assertive decisions in this context. This project aims to develop an automated tool that, employing computer vision and artificial intelligence techniques, is capable of detecting and identifying people in spaces typical to urban environments. This ability to differentiate individuals from other elements in the environment is essential for tasks such as counting people circulating in buildings, analyzing flow between corridors and exhibition aisles, circulation preferences, as well as identifying circulation at unconventional hours, anomalous movement, and visitors' mood, among others. The platform implements all stages of the data pipeline, and the produced information is made available in a Dashboard suitable for this application context. All issues involving LGPD (General Data Protection Law) are considered by the project.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes / Maria Amélia Eliseo / Daniela Vieira Cunha / Leandro Carlos Fernandes - Coordinator / Ivan Carlos Alcantara de Oliveira / Elieder Damasceno Sousa / Alvaro Hibide Claver / Erika Borges Piaui / Gustavo Garabetti Munhoz / João Ricardo de Lima Bonifácio / Jose Eduardo Bernardino Jorge / Bruno Seki Schenberg / Gabriel da Silva Morishita Garbi / Leonardo Santos Rocha.",
        "link": ""
      },
      {
        "title": "Weather Station",
        "description": "In the context of resilient cities, situational information is essential to support decision-making, especially in events where weather is a determining factor to avoid harmful consequences to the population living in clusters susceptible to environmental impacts. Climate data is crucial to contribute to more assertive decision-making, in order to prevent or minimize negative impacts. This project aims to propose and develop a computational architecture capable of orchestrating actions for collecting, analyzing, disseminating, and sharing weather data from meteorological stations deployed within and outside the campus of Universidade Presbiteriana Mackenzie, forming a network of meteorological sensors.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes - Coordinator / Maria Amélia Eliseo / Ivan Carlos Alcantara de Oliveira / Leandro Carlos Fernandes / Elieder Damasceno Sousa / Alvaro Hibide Claver / Erika Borges Piaui / Gustavo Garabetti Munhoz / João Ricardo de Lima Bonifácio / Alan Gleizer / Marcelo Gonzatto Birkan",
        "link": "https://mackleaps.mackenzie.br/dashboard-estacao/"
      },
      {
        "title": "API - Weather Station",
        "description": "API for collecting and distributing meteorological data from the meteorological stations of Universidade Presbiteriana Mackenzie, Higienópolis campus.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "",
        "link": "https://mackleaps.mackenzie.br/meteorologiaapi-docs/#"
      },
      {
        "title": "Street Retail Poles in São Paulo",
        "description": "The research aims to understand the locations of concentration of street retail, their dynamics, and the relationship they establish with the city. Through the mapping of retail sectors, it identifies poles and classifies them into 3 levels linked by sector of activity. The mapping converges to the database, conducts analyses, and presents indicators. The research intends to metricize Urbanity indices in Retail Poles through attributes of connectivity, diversity, and comfort.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes / Maria Amélia Eliseo / Cassia Regina Mariano / Larissa G. Campagner / Cecilia Pisetta / Felipe Cavalheiro dos Anjos / Valter Luis Caldana Junior - Coordinator.",
        "link": "https://mackleaps.mackenzie.br/acsp"
      },
      {
        "title": "Mack-RAG - SAGUI",
        "description": "SAGUI - Intelligent University Management Assistance System. The University has a compendium of documents that govern, regulate, and standardize the diverse academic activities involving its community in the areas of teaching, research, and extension. For students to understand or even search for specific information among the various documents and their updates can be a time-consuming and difficult task. The proposal of this project is to build a Retrieval-Augmented Generation (RAG) system to assist in academic communication, capable of providing information about rules, determinations, deadlines, responsibilities, and activities within the university, through a more user-friendly interface and communication in natural language.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Dirceu Matheus Junior / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha / Ivan Carlos Alcantara de Oliveira / Leandro Carlos Fernandes - Coordinator / Elisangela Botelho Gracias / Maria Amélia Eliseo / Luiz Carlos Machi Lozano / Thiago Graziani Traue.",
        "link": ""
      },
      {
        "title": "Smart Auditorium",
        "description": "Project certified by coordinator Daniela Vieira Cunha on 08/05/2024. There are several situations that we can observe when attending an event. Starting with the event promotion, registration for a spot, pre-event recommendations such as arrival time, whether we can consume food, etc. There are apps that can serve as references such as Meetup and Sympla. We also have physical and virtual auditoriums. How can we improve the user experience in the moments leading up to an event? The aim of this project is to study ways to improve the user experience in the context of events using computational resources for this purpose.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha - Coordinator / Elisangela Botelho Gracias / Maria Amélia Eliseo / Thiago Graziani Traue.",
        "link": ""
      },
      {
        "title": "Virtual Gardening at Um Entreposto",
        "description": "Project certified by coordinator Ivan Carlos Alcântara de Oliveira on 26/04/2024. This project is a collaboration initiative with the startup Um Entreposto, in which the partnership with the Laboratory involves the development of new functionalities for the gardening items e-commerce of this company. Among the operational characteristics are plant identification through Artificial Intelligence techniques and the maintenance of a repository of options containing alternatives for researched specimens.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Leandro Carlos Fernandes / Maria Amélia Eliseo / Ivan Carlos Alcantara de Oliveira - Coordinator / Luiz Carlos Machi Lozano",
        "link": ""
      },
      {
        "title": "APO-PPGCA Project",
        "description": "Among the demands of a stricto-sensu graduate program, the Mandatory Programmed Activities (APO) are among the requirements necessary for obtaining the titles of Master or Doctor. The objective of this project is to develop an application capable of managing the evaluation process of APOs within the scope of PPGCA/FCI/UPM, which will serve as a test-bed for the study of event-driven architectural patterns that collaborate in defining pillars of development for the products generated in the Software Residency.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Maria Amélia Eliseo - Coordinator / Alvaro Hibide Claver / Marcelo Hideki Ogushi Carrera",
        "link": ""
      },
      {
        "title": "Cockpit - Energy-Efficient Car for Competition",
        "description": "Project certified by coordinator Fábio Raia on 26/04/2024. The Student League of the Electric Car, linked to the Mechanical Engineering course of Escola de Engenharia Mackenzie, has an electric traction vehicle and its own electronic control, built on an aluminum tubular chassis and with carbon fiber fairing. The activities of the League explore the theoretical and practical capabilities of students in issues involving both the conception of solutions and the execution and testing of conditioning. In this context, the objective of this project is to collaborate with the Student League of the Electric Car in the development of an embedded system that serves as a cockpit to monitor the vehicle's state and support its drivability.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes / Fabio Raia - Coordinator / Leandro Carlos Fernandes / Elieder Damasceno Sousa.",
        "link": ""
      },
      {
        "title": "Health Surveillance Information System",
        "description": "Information system aimed at registering the establishments targeted by health surveillance in the state of São Paulo, as well as the sanitary inspections carried out in them.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Development",
        "members": "Members: Fábio Silva Lopes - Coordinator",
        "link": ""
      },
      {
        "title": "Digital Twin Mackenzie Campus Higienópolis",
        "description": "The term Living Lab refers to a research approach that involves collaboration among end-users, researchers, and other stakeholders in the creation, development, and testing of innovative solutions for real-world problems. The idea is that the real environment is used as a laboratory to test ideas and solutions, rather than a controlled laboratory environment. However, experiments can collect real-world data to input into a digital model that allows for reproducing simulations of events that are difficult to replicate in the real environment. Digital Twins are digital representations of physical entities. There are various applications and advantages of using this technology, which can function as a geographical dashboard to monitor, simulate, evaluate, explore, or predict events in cities. From this perspective, the project aims to develop a Digital Twin of the Higienópolis campus as a foundational support platform for Living Labs experiments, as an interoperable platform capable of integrating data from various applications focused on the campus, as well as enabling the implementation of new experiments dependent on geographic variables.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes - Coordinator / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha / Leandro Carlos Fernandes / Elisangela Botelho Gracias / Maria Amélia Eliseo / Ivan Carlos Alcantara de Oliveira",
        "link": ""
      },
      {
        "title": "Living Lab Mackenzie",
        "description": "Implementation of a computational platform for collecting, storing, and analyzing sensor data for monitoring activities in physical environments.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes - Coordinator / Maria Amélia Eliseo / Dirceu Matheus Junior / Kassya Christina Rigolon de Andrade / Daniela Vieira Cunha / Ivan Carlos Alcantara de Oliveira / Leandro Carlos Fernandes / Elisangela Botelho Gracias / Marcilyanne Moreira Gois / Bruno da Silva Rodrigues.",
        "link": ""
      },
      {
        "title": "Smart Campus",
        "description": "This is a study and implementation of sensors for measurement, analysis, and generation of indicators for decision-making on a university campus. The Higienópolis campus of UPM is being used as a testbed. Currently, environmental data such as temperature, humidity, CO2 levels, wind speed, among others, are being collected through sensors, generating a dataset exported to a repository, which will be used as a source for exploratory and predictive analyses. Currently, the quality of the generated data is being analyzed, and the modeling of the indicators based on the collected data is being defined.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes - Coordinator / Maria Amélia Eliseo / Ana Claudia Rossi / Daniela Vieira Cunha.",
        "link": ""
      },
      {
        "title": "Learning Objects to Support Software Residency Practices at MackLeaps",
        "description": "This project aims to structure and implement a learning platform to develop levels of maturity in students' skills in the areas of Software Engineering and Human-Computer Interaction, considering immersion in real projects stemming from partnerships with organizations, in order to promote the study, validation, and evaluation of practices and skills, as well as research focused on improving software processes and products.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes - Coordinator / Maria Amélia Eliseo / Dirceu Matheus Junior / Kassya Christina Rigolon de Andrade / Regiane Moreno / Ivan Carlos Alcantara de Oliveira / Leandro Carlos Fernandes / Elisangela Botelho Gracias / Marcilyanne Moreira Gois / Renata Maria Nogueira de Oliveira.",
        "link": ""
      },
      {
        "title": "Creation of Mackenzie-FIESP Sustainability Index",
        "description": "The proposed research problem is the Creation of the Mackenzie-FIESP Sustainability Index, in a partnership between Mackenzie Presbyterian University and the Federation of Industries of the State of São Paulo - FIESP. The research objective is the creation of a sustainability index that allows identifying the results of corporate actions aimed at mitigating the social and environmental impacts of their activities. The sustainability index will be composed of economic, environmental, social, and governance indicators (Economic + Environmental, Social, and Governance / ESG) and will serve as a measurement instrument for companies to identify, project, evaluate, and make decisions regarding their sustainable practices. With support from theoretical foundations and based on the guidelines of the Global Reporting Initiative (GRI), the Mackenzie-FIESP Index may gain international recognition, thus serving as a basis for government policies oriented towards sustainability best practices. In terms of specific objectives, the following phases are ongoing (some already completed): 1. Development of a theoretical/practical foundation for project implementation; 2. Construction of a database of economic, environmental, social, and governance data from Brazilian companies in partnership with FIESP (data collection and transfer). These data must be collected, processed, and prepared for storage in a repository, where they will be available for exploratory analysis; 3. Quantification of economic, environmental, social, and governance indicators, based on the database generated in step 2; 4. Operationalization of a sustainability indicators system so that it can be available for consultation by participating companies; 5. Development of panels that allow the simulation of scenarios, so that participating companies can test alternative changes in their indicators, in order to support their decisions in the search for new levels for their own sustainability indices. This is an interdisciplinary project in partnership with the Center for Social and Applied Sciences.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes / Arnaldo Rabello de Aguiar Vallim Filho - Coordinator / Leandro Augusto da Silva / Luis Carlos Jacob Perera.",
        "link": ""
      },
      {
        "title": "Predictive Analysis Based on Intelligence for Supervisory Systems of Hydroelectric Power Plants",
        "description": "The General Objective of this R&D project is the planning and development of a research experiment aimed at building a mathematical modeling that enables the establishment of new parameters and metrics for operation and maintenance for hydroelectric plants with reservoir lakes, seeking the optimal operational point, considering the volume of water in the reservoirs for human consumption, environmental sustainability, generation, and availability of energy, through advanced predictive mathematical-computational models. The final product of the research will be a prototype of a predictive incident computational tool, aimed at optimizing the turbine maintenance scheduling process. Predictive modeling will be supported by advanced Artificial Intelligence techniques and will be computationally implemented, so that at the end of the project, it will be evaluated in a test environment, having demonstrated adequate performance evolution of the developed modeling.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes / Arnaldo Rabello de Aguiar Vallim Filho - Coordinator / Leandro Augusto da Silva / Dirceu Matheus Junior / Orlando Bisacchi Coelho / Jamilson Bispo dos Santos / Eduardo Mayer Fagundes.",
        "link": ""
      },
      {
        "title": "Human Postural Balance Evaluation",
        "description": "This project promotes the assessment of human body balance through a low-cost force platform. Maintaining body balance during the upright posture is considered a complex task from the perspective of motor control and is one of the most important motor skills for humans to perform daily activities. Controlling balance in activities such as walking, climbing stairs, running, or simply standing requires constant adjustments in movement patterns that vary between genders. This study aims to create a force platform for balance assessment using low-cost materials available in the national market. After developing the equipment, initial tests will be conducted to verify its proper functioning through the assessment of postural balance in young individuals.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes, Ana Claudia Rossi, Silvana Maria Blascovi de Assis, Fabio Raia (Coordinator), Denise Loureiro Viana, Fernanda Simeão Costa, Julia Camargo Marcondes dos Santos, Rosangela Gumaraes Romano, Janina Mazieri Prado Rico, Bianca de Mello Pires, Raquel Cymrot, Gabriel Melo Francisco Correia",
        "link": ""
      },
      {
        "title": "Optimization of Driveability and Monitoring of an Electric Vehicle Prototype",
        "description": "This is a project in partnership with the School of Engineering that develops a prototype of an electric vehicle, which has already been involved in competitions around the world. The involvement of the computing area, including a faculty member from this master's program, concerns the study for the implementation of sensors in the vehicle aimed at obtaining data to optimize the vehicle's driveability. Additionally, data is being collected for the generation and analysis of electrical indicators for continuous monitoring of the electric vehicle.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes, Ana Claudia Rossi, Fabio Raia (Coordinator)",
        "link": ""
      },
      {
        "title": "Study on Student Dropout Rates in Higher Education Courses",
        "description": "This project aims to study the various aspects that impact the academic life of undergraduate students, including the factors that lead to dropout rates.",
        "situation": "Situation: Completed",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes (Coordinator), Argemiro Severiano",
        "link": ""
      },
      {
        "title": "Digital Documentation of Heritage",
        "description": "Digital documentation of heritage: A three-dimensional and temporal model for the Mack-Itambé campus. This research aims to develop and implement a three-dimensional model associated with a database with space-time characteristics for the Mackenzie Itambé campus, delimited to buildings 1-Mackenzie Building and 2-George Alexander Library, enabling navigation through spaces, as well as access to information related to the transformation of these buildings over time.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes, Maria Amélia Eliseo, Ismar Frango da Silveira (Coordinator), Beatriz de Almeida Pacheco",
        "link": ""
      },
      {
        "title": "IntegraEPI",
        "description": "The aim of this research project is to contribute to the modernization of the epidemiological surveillance system, with an emphasis on improving information quality by comparing results of detailed simulations with the experimental standard observed for the spread of an epidemic, both temporally and geographically. This involves the development of algorithms and interactive software that utilize predictive models of spatiotemporal epidemiological behavior in a computational grid environment.",
        "situation": "Situation: Ongoing",
        "natureza": "Nature: Research",
        "members": "Members: Fábio Silva Lopes, Denise Stringhini, Hermes Senger, Fabricio Alves Barbosa da Silva (Coordinator)",
        "link": ""
      }
    ]
  },

  "team": {
    "title": "Team",
    "subtitle": "Meet our current members, collaborators, and former collaborators.",
    "membros": "Current Members",
    "colaboradoresAtuais": "Collaborators",
    "colaboradoresAnteriores": "Former Collaborators",
    "responsaveis": [
      {
        "img": "/members/anaclaudiarossi.jpg",
        "name": "Ana Claudia Rossi",
        "role": "The Mackleaps Laboratory Manager",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4797577Y2"
      },
      {
        "img": "/formerMembers/BrunoDaSilva.jpg",
        "name": "Bruno da Silva",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4731498P8"
      },
      {
        "img": "/members/CalebeDePaula.jpg",
        "name": "Calebe de Paula",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4768567D3"
      },
      {
        "img": "/members/DanielaCunha.jpg",
        "name": "Daniela Vieira Cunha",
        "role": "The Mackleaps Laboratory Manager",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4736051D6"
      },
      {
        "img": "/members/dirceu.jpg",
        "name": "Dirceu Matheus Junior",
        "role": "Postgraduate Coordinator",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4250787A4"
      },
      {
        "img": "/members/elisangela.jpg",
        "name": "Elisângela Botelho Gracias",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4770454P6"
      },
      {
        "img": "/members/fabio.jpg",
        "name": "Fábio Lopes",
        "role": "The Mackleaps Laboratory Manager",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4184023J5"
      },
      {
        "img": "/members/ivan.jpg",
        "name": "Ivan Carlos Alcantara de Oliveira",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4727078U7"
      },
      {
        "img": "/members/kassya.jpg",
        "name": "Kassya Christina Rigolon de Andrade",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4776993J0"
      },
      {
        "img": "/members/leandro.jpg",
        "name": "Leandro Carlos Fernandes",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4705091D5"
      },
      {
        "img": "/members/LuizLozano.png",
        "name": "Luiz Carlos Machi Lozano",
        "role": "Assists the Mackleaps Laboratory",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K8162703U3"
      },
      {
        "img": "/members/maria.jpg",
        "name": "Maria Amelia",
        "role": "The Mackleaps Laboratory Manager",
        "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4751551Z4"
      }
    ],

    "colaboradores": [
      {
        "img": "/formerMembers/alvaro.jpg",
        "name": "Álvaro Hibide Claver",
        "role": "Intern"
      },
      {
        "img": "/formerMembers/elieder.jpg",
        "name": "Elieder Damasceno Sousa",
        "role": "Laboratory Assistant"
      },
      {
        "img": "/formerMembers/erika.jpg",
        "name": "Erika Borges Piaui",
        "role": "Intern"
      },
      {
        "img": "/formerMembers/gustavoGarabetti.jpg",
        "name": "Gustavo Garabetti Munhoz",
        "role": "Intern"
      },
      {
        "img": "/members/joao.jpeg",
        "name": "João Ricardo de Lima Bonifácio",
        "role": "Laboratory Assistant"
      }
    ],

    "excolaboradores": [
      {
        "img": "/formerMembers/alanRicardo.jpg",
        "name": "Alan Ricardo",
        "date": "2019 to 2020"
      },
      {
        "img": "/formerMembers/andre.jpeg",
        "name": "André Philipe Andriotti de Moraes",
        "date": "2022 to 2023"
      },
      {
        "img": "/formerMembers/beatriz.jpg",
        "name": "Beatriz Marmo Scaglione",
        "date": "2022"
      },
      {
        "img": "/formerMembers/BrunaDiGiovanni.png",
        "name": "Bruna Di Giovanni",
        "date": ""
      },
      {
        "img": "/formerMembers/Bruno.jpg",
        "name": "Bruno Eduardo",
        "date": "2021"
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "Caio Dias",
        "date": ""
      },
      {
        "img": "/formerMembers/Claudia.jpg",
        "name": "Claudia Fiorentino Andrade",
        "date": "2021 to 2022"
      },
      {
        "img": "/formerMembers/claudionor.jpg",
        "name": "Claudionor Domingues",
        "date": "2023"
      },
      {
        "img": "/formerMembers/DanielDLima.png",
        "name": "Daniel D. Lima",
        "date": ""
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "Douglas",
        "date": "2023"
      },
      {
        "img": "/formerMembers/EduardoKobaiashi.png",
        "name": "Eduardo Kobaiashi",
        "date": ""
      },
      {
        "img": "/formerMembers/ErickLopes.png",
        "name": "Erick Fernando Doria Lopes",
        "date": "2017 to 2019"
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "Gabriel Lemos",
        "date": ""
      },
      {
        "img": "/formerMembers/GabrielMeloFranciscoCorreia.png",
        "name": "Gabriel Melo Francisco Correia",
        "date": "2018"
      },
      {
        "img": "/formerMembers/GabrielSouza.jpg",
        "name": "Gabriel Souza",
        "date": "2019 to 2020"
      },
      {
        "img": "/formerMembers/GiovanniVicario.png",
        "name": "Giovanni Vicário",
        "date": "2019"
      },
      {
        "img": "/formerMembers/GuilhermeLopesdeOliveira.jpg",
        "name": "Guilherme Lopes de Oliveira",
        "date": "2019 to 2020"
      },
      {
        "img": "/formerMembers/GuilhermeReis.png",
        "name": "Guilherme Reis",
        "date": ""
      },
      {
        "img": "/formerMembers/GustavoKozonoe.jpeg",
        "name": "Gustavo Kozonoe",
        "date": ""
      },
      {
        "img": "/formerMembers/IagoSalomon.jpg",
        "name": "Iago Salomon",
        "date": "2018"
      },
      {
        "img": "/formerMembers/irvin.jpg",
        "name": "Irvin Ken Xavier Tavares",
        "date": "2022"
      },
      {
        "img": "/formerMembers/IsabelaRuizRoquedaSilva.png",
        "name": "Isabela Ruiz Roque da Silva",
        "date": "2019 to 2021"
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "João Pedro Bianchini Ramos",
        "date": "2023"
      },
      {
        "img": "/formerMembers/zezinho.jpeg",
        "name": "José Eduardo Bernardino Jorge",
        "date": "2022 to 2023"
      },
      {
        "img": "/formerMembers/Kleber.png",
        "name": "Kleber Yoshida",
        "date": ""
      },
      {
        "img": "/formerMembers/Leandro.png",
        "name": "Leandro Alexandre",
        "date": "2018"
      },
      {
        "img": "/formerMembers/LeandroReis.jpeg",
        "name": "Leandro Reis",
        "date": "2019 to 2020"
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "Leandro Soares Dantas",
        "date": ""
      },
      {
        "img": "/formerMembers/Leticia.jpg",
        "name": "Letícia Colombo",
        "date": "2021 to 2022"
      },
      {
        "img": "/formerMembers/lidia.png",
        "name": "Lídia Carolina",
        "date": "2023"
      },
      {
        "img": "/formerMembers/Lucas.jpg",
        "name": "Lucas",
        "date": ""
      },
      {
        "img": "/formerMembers/lucasEllery.jpg",
        "name": "Lucas Ellery Viana",
        "date": "2022 to 2023"
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "Lucas Hort",
        "date": ""
      },
      {
        "img": "/formerMembers/semFoto.png",
        "name": "Lucas Tonin",
        "date": "2023"
      },
      {
        "img": "/formerMembers/MarceloTakayama.png",
        "name": "Marcelo Takayama",
        "date": "2019 to 2020"
      },
      {
        "img": "/formerMembers/marcosRaia.jpg",
        "name": "Marcos Librelon Raia",
        "date": "2023"
      },
      {
        "img": "/formerMembers/matheusGois.jpg",
        "name": "Matheus Gois",
        "date": "2017 to 2019"
      },
      {
        "img": "/formerMembers/MatheusPortilho.jpeg",
        "name": "Matheus de Oliveira Portilho",
        "date": "2022"
      },
      {
        "img": "/formerMembers/Silvestre.jpeg",
        "name": "Matheus Oliveira Silvestre",
        "date": "2021 to 2022"
      },
      {
        "img": "/formerMembers/Mikael.jpg",
        "name": "Mikael Muniz",
        "date": "2020 to 2023"
      },
      {
        "img": "/formerMembers/RafaelLua.jpg",
        "name": "Rafael Lua",
        "date": "2019 to 2020"
      },
      {
        "img": "/formerMembers/RafaelVieira.jpeg",
        "name": "Rafael Vieira Brancaccio",
        "date": ""
      },
      {
        "img": "/formerMembers/Renato Alves Ribeiro.jpeg",
        "name": "Renato Alves Ribeiro",
        "date": ""
      },
      {
        "img": "/formerMembers/RobertoTsunki.jpg",
        "name": "Roberto Tsunki",
        "date": "2020"
      },
      {
        "img": "/formerMembers/Sabrinna.jpg",
        "name": "Sabrinna Delgado",
        "date": "2019 to 2022"
      },
      {
        "img": "/formerMembers/thiagoAguirre.jpg",
        "name": "Thiago Oliveira Aguirre",
        "date": "2023"
      },
      {
        "img": "/formerMembers/vitorRavacci.jpg",
        "name": "Vitor Ravacci",
        "date": ""
      },
      {
        "img": "/formerMembers/WolfgangWalder.png",
        "name": "Wolfgang Walder",
        "date": "2018"
      }
    ]
  },

  "news": {
    "title": "News",
    "subtitle": "Latest News",
    "leiaMais": "Read More",
    "buscar": "Search",
    "noticias": [
      {
        "id": "1",
        "img": "/code.jpeg",
        "date": "20 Mai. 2024",
        "author": "Administrador",
        "author_img": "/author.jpeg",
        "title": "Book Release 2024",
        "description": "This news promotes the release of the latest books launched on May 27, 2024, authored by some professors from FCI.",
        "body": {
          "__html": "<p>This news promotes the release of the latest books authored by some professors from FCI. <b>The launch took place on May 27, 2024, in collaboration with Editora Mackenzie</b> and the <b>Graduate Program in Applied Computing.</b> Below are the respective releases:</p><br><p><b>1 - Introduction to Time Series:</b> A Practical Approach in Python.</p><p><b>Authors:</b> Rogério de Oliveira, Orlando Yesid Esparza Albarracin, and Gustavo Rocha da Silva.</p><p><b>Publisher:</b> Editora Mackenzie</p><br><p><b>2 - Introduction to Data Science and Interactive Systems:</b> An Applied Approach.</p><p><b>Authors:</b> Ana Grasielle Dionísio Corrêa, Arnaldo Rabello de Aguiar Vallim Filho, Maria Amelia Eliseo, Valéria</p><p><b>Publisher:</b> LF Editorial</p><br><p><b>3 - Statistical Analysis and Modeling for Beginners:</b> Applications in R.</p><p><b>Author:</b> Arnaldo Rabello Aguiar Vallim Filho</p><p><b>Publisher:</b> LF Editorial</p><br><img src='/livros.jpg' alt='Livros'>"
        }
      },
      {
        "id": "2",
        "img": "/code.jpeg",
        "date": "May 20, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "Registrations closed - Scientific Initiation",
        "description": "",
        "body": {
          "__html": "<p>Registrations for the Scientific Initiation program are open. Register between 8:00 am on March 6, 2024, and April 30, 2024!</p><br><p><b>Documents and registration:</b></p><br><p>1 - Completion of registration forms in the system</p><br><p>2 - Complete research project without identification of the authors, according to the template provided by the Research Promotion Coordination (CFP);</p><br><p>3 - Link to the student's Lattes Curriculum for consultation by the Research Promotion Coordination (CFP);</p><br><p>4 - Academic transcript for students from the 2nd semester onwards and proof of ongoing courses for students from the 1st semester;</p><br><p>5 - Consent and approval of the supervisor, with the respective link to the Lattes Curriculum and ORCID identification.</p><br><p><b>Register as a student:</b></p><a href='https://forms.office.com/r/cgLgYD0DRQ' target='_blank'>Student registration</a><br><br><p><b>Register as a supervisor:</b></p><a href='https://forms.office.com/r/qmrqZdCNPs' target='_blank'>Supervisor registration</a><br><br><p><b>For more information, read the full notice:</b></p><a href='https://drive.google.com/file/d/1gmVvhOqoHJ3KEeKZsB-cbYxtElOx4LXP/view?usp=drive_link' target='_blank'>Full notice</a><br><br><p><b>Consult the list of areas of activity of the supervisors:</b></p><a href='https://drive.google.com/file/d/1u8e79X2kmc1o2_Hkupa6Uia1wYY352Mn/view?usp=sharing' target='_blank'>Areas of activity</a>"
        }
      },
      {
        "id": "3",
        "img": "/code.jpeg",
        "date": "March 13, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "Notice - Scientific Initiation",
        "description": "This notice presents the call for proposals for the selection of projects within the Institutional Scientific Initiation Program.",
        "body": {
          "__html": "<p>The Rectorate of Mackenzie Presbyterian University, through its Research Promotion Coordination, of the Vice-Rector's Office for Research and Postgraduate Studies (CFP/PRPG), hereby makes public this Notice for the call for proposals for the selection of projects within the Institutional Scientific Initiation Program.</p><br><p><b>Requirements for students: </b></p><br><p>1 - Be regularly enrolled in an undergraduate course at UPM between the first and the penultimate semester at the time of registration in the Institutional Scientific Initiation Program. Dedicate themselves fully to academic and research activities;</p><br><p>2 - Present satisfactory academic performance, evidenced in their academic transcript;</p><br><p>3 - Do not combine the Scientific Initiation scholarship with scholarships for teaching assistance, extension, technological initiation, PIBID, and research scholarships classified under other modalities, offered by Mackenzie Presbyterian University, Mackenzie Research Fund - MackPesquisa, CNPq or any national, foreign or international agencies for the promotion of teaching and research or similar entities;</p><br><p>4 - For the purposes of this Notice, simultaneous enjoyment of the Scientific Initiation scholarship and research scholarships from training/teaching projects and/or those that meet assistance, maintenance or permanence objectives, especially when the amounts are directly transferred to students, and whose purposes are different from Scientific Initiation research, will not be considered as accumulation of scholarships;</p><br><p>5 - Not have a direct lineal kinship with the supervisor;</p><br><p>6 - As a scholarship holder, it is not allowed to have an employment relationship under CLT regime, have a relationship with the public service (be a civil servant), participate in the Young Apprentice program, or engage in activities as a freelancer, generating income;</p><br><p>7 - If the student has an employment relationship, participates in the Young Apprentice Program, works as a freelancer, or is receiving any type of research scholarship or teaching assistance, they may register as a volunteer (Institutional Volunteer Scientific Initiation Program - PIVIC). This Program, excluding the scholarship payment, offers students the same benefits as PIBIC;</p><br><p>8 - A scholarship may be granted to a student who is in mandatory internships and non-mandatory internships, provided there is a joint declaration from the Academic Unit, the internship supervisor, and the research supervisor, showing that the internship will not affect their dedication to academic and research activities.</p><br><p><b>Requirements for supervisors: </b></p><br><p>1 - Be a teacher and researcher affiliated with the Academic Units of Mackenzie Presbyterian University;</p><br><p>2 - Have a doctoral or master's degree and work full-time (PPI) or part-time (PPP);</p><br><p>3 - Have scientific, technical, or artistic-cultural production from the last four years, published in indexed scientific journals related to the area of knowledge in which the teacher works. The supervisor's productivity information will be validated from the consultation of the respective curriculum filled out in the Lattes Platform;</p><br><p>4 - Have an updated Lattes Curriculum in the current semester;</p><br><p>5 - Have ORCiD registration;</p><br><p>6 - Be part of an ongoing research project, as a leader or participant, registered and updated in the Academic Unit, in the Lattes Platform, and approved in the PDA by the Research Coordinator of the Academic Unit;</p><br><p>7 - In the case of a new project, it must also have been indicated and approved in the PDA by the Research Coordinator of the Academic Unit and be registered in the Lattes Curriculum;</p><br><p>8 - The supervisor must have research availability in the PDA for the guidance of the Scientific Initiation project in question;</p><br><p>9 - Not have pending issues resulting from previous Scientific Initiation guidance, such as: open reports, performance assessments of their advisees, and other relevant to the process.</p><br><a href='https://drive.google.com/file/d/1gmVvhOqoHJ3KEeKZsB-cbYxtElOx4LXP/view?usp=drive_link' target='_blank'>Full notice</a>"
        }
      },
      {
        "id": "4",
        "img": "/code.jpeg",
        "date": "May 20, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "Registrations Closed - Technological Initiation",
        "description": "",
        "body": {
          "__html": "<p>Registrations for the Technological Initiation program are open. Register between 8:00 am on March 6, 2024, and April 30, 2024!</p><br><p><b>Documents:</b></p><br><p>1 - Complete project without identification of the authors</p><br><p>2 - Link to the supervisor's Lattes Curriculum</p><br><p>3 - Link to the student's Lattes Curriculum</p><br><p>4 - Digital copy of the student's academic transcript</p><br><p><b>Submit student project:</b></p><a href='https://forms.office.com/r/Z161TR9NU0' target='_blank'>Submit student project</a><br><br><p><b>Submit supervisor project:</b></p><a href='https://forms.office.com/r/9jAFDfdgk9' target='_blank'>Submit supervisor project</a><br><br><p><b>For more information, read the full notice:</b></p><a href='https://drive.google.com/file/d/1nC2L9pgD3cxmvk30phDluPfqO5gRqzFw/view?usp=sharing' target='_blank'>Full notice</a><br>"
        }
      },
      {
        "id": "5",
        "img": "/code.jpeg",
        "date": "March 13, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "Notice - Technological Initiation",
        "description": "This notice presents the call for proposals for the selection of projects within the Institutional Program for Technological Initiation and Innovation.",
        "body": {
          "__html": "<p>The Rectorate of Mackenzie Presbyterian University, through its Coordination of Innovation and Technologies (CIT), of the Vice-Rector's Office for Research and Postgraduate Studies (PRPG), hereby makes public this notice for the opening of registrations, aiming at the selection of projects for the Institutional Program of Technological Initiation and Innovation Scholarships (PIBITI/PIVITI) Mackenzie and CNPq PIBITI.</p><br><p><b>Requirements for students: </b></p><br><p>1 - Be a student with regular enrollment in an undergraduate course at Mackenzie Presbyterian University and enrolled in disciplines during the validity of the Technological Initiation and Innovation Program;</p><br><p>2 - Be a student with regular enrollment in an undergraduate course at Mackenzie Presbyterian University and enrolled in disciplines during the validity of the Technological Initiation and Innovation Program;</p><br><p>3 - Do not combine the Technological Initiation scholarship with scholarships for teaching assistance, extension, scientific initiation, and research scholarships classified under other modalities, offered by Mackenzie Presbyterian University, Mackenzie Research Fund;</p><br><p>4 - Not have a direct lineal kinship with the supervisor;</p><br><p>5 - As a scholarship holder, it is not allowed to have an employment relationship under CLT regime, have a relationship with the public service (be a civil servant), participate in the Young Apprentice program, or engage in activities as a freelancer, generating income;</p><br><p>6 - If the student has an employment relationship, participates in the Young Apprentice Program, works as a freelancer, or is receiving any type of research scholarship or teaching assistance, they may register as a volunteer (Institutional Volunteer Scientific Initiation Program - PIVIC). This Program, excluding the scholarship payment, offers students the same benefits as PIBIC;</p><br><p>7 - A scholarship may be granted to a student who is in mandatory internships and non-mandatory internships, provided there is a joint declaration from the Academic Unit, the internship supervisor, and the research supervisor, showing that the internship will not affect their dedication to academic and research activities.</p><br><p><b>Requirements for supervisors: </b></p><br><p>1 - Be a teacher and researcher affiliated with the Academic Units of Mackenzie Presbyterian University;</p><br><p>2 - Have a doctoral or master's degree and work full-time (PPI) or part-time (PPP);</p><br><p>3 - Have scientific, technical, or artistic-cultural production from the last four years, published in indexed scientific journals related to the area of knowledge in which the teacher works. The supervisor's productivity information will be validated from the consultation of the respective curriculum filled out in the Lattes Platform;</p><br><p>4 - Have an updated Lattes Curriculum in the current semester;</p><br><p>5 - The supervisor must have research availability in the PDA for the guidance of the Technological Initiation project in question;</p><br><p>6 - Not have pending issues resulting from previous Scientific Initiation guidance, such as: open reports, performance assessments of their advisees, and other relevant to the process.</p><br><a href='https://drive.google.com/file/d/1nC2L9pgD3cxmvk30phDluPfqO5gRqzFw/view?usp=sharing' target='_blank'>Full notice</a>"
        }
      },
      {
        "id": "6",
        "img": "/code.jpeg",
        "date": "February 29, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "List of Approved Candidates - Software Residency (2024/1)",
        "description": "Check the approved students to join the Software Residency (2024/1)",
        "body": {
          "__html": "<a href='https://drive.google.com/file/d/125qd-rUlw5Xp7DIkhErfCFHXTdan_d67/view?usp=sharing' target='_blank'>Check the list of approved candidates</a><br><br><p>The second stage (and final stage) of the selection process for the 2024/1 Software Residency took place on February 28, 2024. This announcement aims to present the list of approved students. Please pay attention to the information below which provides guidance on your first day at the Residency:</p><br><p><b>Welcome to the MackLeaps lab!</b></p><br><p>The <b>start of activities</b> at the Software Residency will take place on <b>March 4th (Monday) from 2:00 PM to 3:30 PM</b>.</p><br><p>For <b>students approved from face-to-face courses</b>, we await your presence at <b>building 6 - room 203</b>.<br><br>For <b>students approved from online courses</b>, the meeting will be <b>via Teams</b> and everyone has been added to this event, just <b>access the link on the date/time provided above</b>.</p><br><p>For any questions, please contact <b>ivan.oliveira@mackenzie.br</b>.<br><br></p><p>MackLeaps Professors Team – Software Residency</p><p>Coordination: Prof. Dr. Fábio Silva Lopes and Prof. Dr. Maria Amélia Eliseo. </p>"
        }
      },
      {
        "id": "7",
        "img": "/code.jpeg",
        "date": "February 19, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "Selection Process - Software Residency (2024/1)",
        "description": "Registrations Closed!",
        "body": {
          "__html": "<p>The Software Residency Program PRSw - FCI/MackLeaps aims to foster professional training in Software Engineering and Human-Computer Interaction for work in project activities, considering human factors, implementation, and testing in computational application projects.</p><p>The Software Residency is a process that occurs in a practical approach, through immersion environments, research, and collaboration, guided by professors, in real, business, or extension projects, to promote maturity in the professional practices demanded by the market.</p><p>The PRSw-FCI/MackLeaps consists of participating in a Roadmap of five modules focused on implementing a real graduation project, which includes: theoretical and practical team laboratory classes; construction of software artifacts related to the real project under development; study of technological tools for communication, collaboration, and artifact construction; study and development of Digital Educational Resources for learning the elements of the Program modules; evaluation of the process and learning of the work in each module; among others.</p><p>In addition to participating in real projects, this is also a great opportunity to obtain complementary or extension activity hours. Stay tuned!</p><p>This announcement aims to communicate the opening of the selection process for 2024/1 for those interested in the project. The students selected in this 1st stage will be notified by email and called to participate in the 2nd stage, which will take place between February 27 and 29. Probably, February 28 from 2:00 PM to 5:00 PM (in-person/virtual). Mark it on your calendar!</p><p>The results of the selected students will be announced on the MackLeaps website (https://mackleaps.mackenzie.br/) at the end of the day on March 1st. The scheduled start of activities will be on March 4th (Monday) from 2:00 PM to 4:00 PM. We look forward to welcoming new residents!</p><a href='https://forms.office.com/r/KZewd7xbpz' target='_blank'>Register</a>"
        }
      },
      {
        "id": "8",
        "img": "/code.jpeg",
        "date": "February 19, 2024",
        "author": "Administrator",
        "author_img": "/author.jpeg",
        "title": "Notice - Software Residency 2024/1",
        "description": "This Notice presents and discloses the 5th edition of the Software Residency Program (PRSw - FCI/MackLeaps).",
        "body": {
          "__html": "<p>This Notice presents and discloses the 5th edition of the Software Residency Program (PRSw - FCI/MackLeaps) detailing: inherent aspects, stages of the selection process, number of vacancies, and others.</p><p>The Laboratory of Software Production Environments Studies - MackLeaps/FCI/UPM created in 2021 a Software Residency, aiming to expand the learning potential in Software Engineering and Human-Computer Interaction through practices known in the market with PBL (Problem Based Learning) and CBL (Challenge Based Learning).</p><p>Such teaching practices, already known and adopted in areas like Health and Computing, have the potential to generate student engagement in the development of Soft Skills, such as Leadership, Empathy, Teamwork, Engagement, among others, and Hard Skills of Software Engineering such as Agile Methods, System Development, and Human-Computer Interaction, providing better results in the teaching and learning process in the involved areas.</p><p>The Software Residency Program PRSw - FCI/MackLeaps aims to foster professional training in Software Engineering and Human-Computer Interaction for work in project activities, considering human factors, implementation, and testing in computational application projects.</p><p>The Software Residency is a process that occurs in a practical approach, through immersion environments, research, and collaboration, guided by professors, in real, business, or extension projects, to promote maturity in the professional practices demanded by the market.</p><p>The students entering the 4th edition (2nd semester of 2023) had the opportunity to actively participate in the DEV and DevOps stages (including testing, T&D), illustrated in Figure 1, involving the projects: People Counter, Weather Station, Eastern Evaluation System, and MackLeaps Website. The newcomers in this 5th edition (1st semester of 2024) will have the opportunity to participate in new projects from companies and institutions captured by MackLeaps and to carry out the requirement specification of these projects, the UXD stage (Figure 1), going as far as implementing their front-end. The involvement of students in these projects generates a great chance of internships and jobs in these places.</p><p>The number of vacancies for this edition is limited to 15. The Program's committee of professors will select the candidates through interviews/dynamics or other activities deemed pertinent, having as criteria: Interest, motivation, availability, oral and written communication skills, collaboration and teamwork ability, and some technical knowledge.</p><p><a href='https://drive.google.com/file/d/1NGraA2V6GycaomLfm63mVuwazB8KtQY2/view?usp=drive_link' target='_blank'>Full notice</a></p>"
        }
      }
    ]
  },

  "projects": {
    "title": "Projects",
    "subtitle": "All projects",
    "projetos": [
      {
        "id": "1",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Weather Station",
        "body": "The system consists of an application that communicates with a weather station and its sensors, collecting and manipulating real-time weather data. The system stores the collected data in a database, offering functions such as filtering and downloading raw data for analysis purposes. Also included in the application is an API (Application Programming Interface) that provides updated real-time data for use in external computational systems. The graphical interface will be provided through a responsive web page, presenting dashboards and data analysis graphs. Users of the system should access current weather information (temperature, probability of rain, humidity) from a dashboard on a web page. Additionally, it should be possible to download stored data from all station sensors. The system should also offer the possibility to filter the visualization and download of data considering parameters such as period, type of data, and file extension that the user desires. It will also be possible to view interactive graphs in a simple and summarized way for rain, humidity, wind speed, and temperature histories. Data from the weather station should be fetched and loaded into the database every 15 minutes. Finally, the system should have an alert area visible on the homepage informing the user about risk situations such as high temperatures, strong winds, and low air humidity. Alerts should also be sent via push notifications.",
        "description": "Application that communicates with a weather station and its sensors, collecting and manipulating real-time weather data."
      },
      {
        "id": "2",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Mackleaps Website",
        "body": "The Mackleaps website aims to disseminate ongoing and completed research and projects related to technology, as well as recruit potential members and partners such as students, companies, academic institutions, and researchers with similar purposes. To achieve this, the system needs to be constantly updated with relevant data selected by the administrators. Furthermore, interested parties should not only be able to familiarize themselves with the conducted works but also have an overview of the laboratory, its team, and means to contact the lab for inquiries, scheduling visits, or meetings. Currently, the website faces some technical and design issues that hinder or discourage its use, such as the lack of a main menu with shortcuts to all website sections for streamlined navigation, static and uninteresting icons, generic and insufficiently informative texts, especially regarding projects and research, which should be the main focus and require a specific and detailed section, unprofessional or unrelated images to the technology field, absence of documentation, and a completely centralized architecture, among other issues to be further addressed in this report and throughout the Residency program. Thus, considering the necessity to stand out among other research laboratories in the technology field and demonstrate the commitment of lab members, this project aims to make the Mackleaps website more appealing, interesting, dynamic, modern, easy to navigate (across all platforms), intuitive, and fast, as well as facilitate its frequent updates.",
        "description": "Aims to disseminate research and projects related to technology and recruit potential members and partners."
      },
      {
        "id": "3",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "People Counter",
        "body": "This project aims to develop and implement the People Counter system for monitoring individuals on the Higienópolis campus of Mackenzie University. The system will collect data on people's movements, store them in a cloud-based database, and provide customized reports through a web application, turning data into useful information with customization possibilities. The goal is to provide real-time information to assist professors, coordinators, security teams, and other administrative members of the university in making decisions related to campus security, organization, and management. Through the local server, where videos captured by ESP-32-CAMs will be centralized, the system should be able to process images (videos) using OpenCV to generate information. Additionally, it will consist of the following servers: Image capture server, Image processing server, Database server, and Web application server, which can be either local (Windows Server, Ubuntu Server, CentOS) or cloud-based. The web application and dashboard are crucial components for presenting collected information in an accessible and useful manner. These requirements detail the necessary functionalities for the web interface. In terms of performance, the system should provide real-time responses when accessing the dashboard or generating reports, with a maximum response time of 2 seconds for any user action. Finally, the system should be configured to perform regular backups of stored data in case of failures or data loss.",
        "description": "Aims to count the number of people entering buildings on the Higienópolis campus of Mackenzie University."
      },
      {
        "id": "4",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Oriente 2.0",
        "body": "Oriente is a TCC submission/tracking system where professors can monitor their students' TCC and evaluate projects from other supervisors when their assessment is requested. In an overview, Oriente provides better visualization for professors and students regarding their TCCs. The system will have the following users: coordinating professor, supervising professor, evaluating professor, substitute professor, and student. The coordinating professor can delete projects, reset passwords, remove individuals, and activate the poster session event. The supervising professor can accept projects submitted by students, schedule evaluations, and has access to the project and its supervised students. The evaluating professor accepts when requested as an evaluator for a project, views the projects to be evaluated, and submits grades for the evaluated projects. The substitute professor accepts when requested as a substitute for a project, views the projects to be evaluated, and submits grades for the evaluated projects (substitute evaluation is only required if an evaluator does not submit their grade). Finally, students view their projects and accept if their participation in a project is requested.",
        "description": "It is a TCC submission/tracking system that provides better visualization for professors and students regarding their projects."
      },
      {
        "id": "5",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "AR-TWO",
        "body": "An application for identifying lung disorders using a blowing mechanism that provides both diagnostics and treatments.",
        "description": "An application for identifying lung disorders using a blowing mechanism that provides both diagnostics and treatments."
      },
      {
        "id": "6",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "IDT",
        "body": "A process model for screening students with signs of Autism Spectrum Disorder and Intellectual Disability.",
        "description": "A process model for screening students with signs of Autism Spectrum Disorder and Intellectual Disability."
      },
      {
        "id": "7",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "ISMF",
        "body": "A system for creating the Sustainability Index of the Presbyterian Mackenzie University.",
        "description": "A system for creating the Sustainability Index of the Presbyterian Mackenzie University."
      },
      {
        "id": "8",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Tagarela",
        "body": "Digital Validation Tool for Early Identification of Language Deficits in Children.",
        "description": "Digital Validation Tool for Early Identification of Language Deficits in Children."
      },
      {
        "id": "9",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Force Platform",
        "body": "Evaluation of human postural balance through a force platform.",
        "description": "Evaluation of human postural balance through a force platform."
      },
      {
        "id": "10",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Mackenzie volunteer",
        "body": "A web platform for Mackenzie Voluntário aimed at registering projects and participants of social actions.",
        "description": "A web platform for Mackenzie Voluntário aimed at registering projects and participants of social actions."
      },
      {
        "id": "11",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Latin Project",
        "body": "A platform for the free distribution of e-books created by local teachers and authors in Latin America.",
        "description": "A platform for the free distribution of e-books created by local teachers and authors in Latin America."
      },
      {
        "id": "12",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Onboard Computer",
        "body": "Application for controlling the Electric Car, an ultra-efficient prototype powered by electricity developed by the Mackenzie School of Engineering.",
        "description": "Application for controlling the Electric Car, an ultra-efficient prototype powered by electricity developed by the Mackenzie School of Engineering."
      },
      {
        "id": "13",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Atlas",
        "body": "The Americas Atlas is a digital initiative aimed at providing a centralized and reliable resource for information related to border laws and regulations across the American continent. This website is specially designed to meet the needs of professionals working in border services, offering easy access to updated and relevant data for border management and immigration processes.",
        "description": "The Americas Atlas is a digital initiative aimed at providing a centralized and reliable resource for information related to border laws and regulations across the American continent."
      },
      {
        "id": "14",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Dashboard - Eletric Car",
        "body": "The electric car is a UPM project involving students from various courses at the School of Engineering. It consists of manufacturing a car that achieves energy efficiency, using techniques and knowledge from the fields of mechanics, electrical engineering, electronics, programming, among others. The objective is participation in the Shell Eco-marathon, a global academic program focused on energy efficiency and one of the world's premier engineering student competitions. In addition to the mechanical and electrical structure, the car uses sensors to monitor current and voltage consumption, temperature, and vehicle speed. These data are displayed on a panel; an application developed for a smartphone is fixed to the car's steering wheel so that the driver can monitor the vehicle's performance according to their actions. All communication between the Arduino and the application is done via USB cable, using the UART (Universal Asynchronous Receiver-Transmitter) serial protocol. Sensor data, after processing, are packaged into a JSON-formatted string and sent to the application, which receives this string and displays the values.",
        "description": "It consists of manufacturing a car that achieves energy efficiency, using techniques and knowledge from the fields of mechanics, electrical engineering, electronics, programming, among others."
      }
    ]
  },

  "research": {
    "title": "Research",
    "subtitle": "All scientific productions",
    "projetos": [
      {
        "id": "1",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Weather Station",
        "body": "The system consists of an application that communicates with a weather station and its sensors, collecting and manipulating real-time weather data. The system stores the collected data in a database, offering functions such as filtering and downloading raw data for analysis purposes. Also included in the application is an API (Application Programming Interface) that provides updated real-time data for use in external computational systems. The graphical interface will be provided through a responsive web page, presenting dashboards and data analysis graphs. Users of the system should access current weather information (temperature, probability of rain, humidity) from a dashboard on a web page. Additionally, it should be possible to download stored data from all station sensors. The system should also offer the possibility to filter the visualization and download of data considering parameters such as period, type of data, and file extension that the user desires. It will also be possible to view interactive graphs in a simple and summarized way for rain, humidity, wind speed, and temperature histories. Data from the weather station should be fetched and loaded into the database every 15 minutes. Finally, the system should have an alert area visible on the homepage informing the user about risk situations such as high temperatures, strong winds, and low air humidity. Alerts should also be sent via push notifications.",
        "description": "Application that communicates with a weather station and its sensors, collecting and manipulating real-time weather data."
      },
      {
        "id": "2",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Mackleaps Website",
        "body": "The Mackleaps website aims to disseminate ongoing and completed research and projects related to technology, as well as recruit potential members and partners such as students, companies, academic institutions, and researchers with similar purposes. To achieve this, the system needs to be constantly updated with relevant data selected by the administrators. Furthermore, interested parties should not only be able to familiarize themselves with the conducted works but also have an overview of the laboratory, its team, and means to contact the lab for inquiries, scheduling visits, or meetings. Currently, the website faces some technical and design issues that hinder or discourage its use, such as the lack of a main menu with shortcuts to all website sections for streamlined navigation, static and uninteresting icons, generic and insufficiently informative texts, especially regarding projects and research, which should be the main focus and require a specific and detailed section, unprofessional or unrelated images to the technology field, absence of documentation, and a completely centralized architecture, among other issues to be further addressed in this report and throughout the Residency program. Thus, considering the necessity to stand out among other research laboratories in the technology field and demonstrate the commitment of lab members, this project aims to make the Mackleaps website more appealing, interesting, dynamic, modern, easy to navigate (across all platforms), intuitive, and fast, as well as facilitate its frequent updates.",
        "description": "Aims to disseminate research and projects related to technology and recruit potential members and partners."
      },
      {
        "id": "3",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "People Counter",
        "body": "This project aims to develop and implement the People Counter system for monitoring individuals on the Higienópolis campus of Mackenzie University. The system will collect data on people's movements, store them in a cloud-based database, and provide customized reports through a web application, turning data into useful information with customization possibilities. The goal is to provide real-time information to assist professors, coordinators, security teams, and other administrative members of the university in making decisions related to campus security, organization, and management. Through the local server, where videos captured by ESP-32-CAMs will be centralized, the system should be able to process images (videos) using OpenCV to generate information. Additionally, it will consist of the following servers: Image capture server, Image processing server, Database server, and Web application server, which can be either local (Windows Server, Ubuntu Server, CentOS) or cloud-based. The web application and dashboard are crucial components for presenting collected information in an accessible and useful manner. These requirements detail the necessary functionalities for the web interface. In terms of performance, the system should provide real-time responses when accessing the dashboard or generating reports, with a maximum response time of 2 seconds for any user action. Finally, the system should be configured to perform regular backups of stored data in case of failures or data loss.",
        "description": "Aims to count the number of people entering buildings on the Higienópolis campus of Mackenzie University."
      },
      {
        "id": "4",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Oriente 2.0",
        "body": "Oriente is a TCC submission/tracking system where professors can monitor their students' TCC and evaluate projects from other supervisors when their assessment is requested. In an overview, Oriente provides better visualization for professors and students regarding their TCCs. The system will have the following users: coordinating professor, supervising professor, evaluating professor, substitute professor, and student. The coordinating professor can delete projects, reset passwords, remove individuals, and activate the poster session event. The supervising professor can accept projects submitted by students, schedule evaluations, and has access to the project and its supervised students. The evaluating professor accepts when requested as an evaluator for a project, views the projects to be evaluated, and submits grades for the evaluated projects. The substitute professor accepts when requested as a substitute for a project, views the projects to be evaluated, and submits grades for the evaluated projects (substitute evaluation is only required if an evaluator does not submit their grade). Finally, students view their projects and accept if their participation in a project is requested.",
        "description": "It is a TCC submission/tracking system that provides better visualization for professors and students regarding their projects."
      },
      {
        "id": "5",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "AR-TWO",
        "body": "An application for identifying lung disorders using a blowing mechanism that provides both diagnostics and treatments.",
        "description": "An application for identifying lung disorders using a blowing mechanism that provides both diagnostics and treatments."
      },
      {
        "id": "6",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "IDT",
        "body": "A process model for screening students with signs of Autism Spectrum Disorder and Intellectual Disability.",
        "description": "A process model for screening students with signs of Autism Spectrum Disorder and Intellectual Disability."
      },
      {
        "id": "7",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "ISMF",
        "body": "A system for creating the Sustainability Index of the Presbyterian Mackenzie University.",
        "description": "A system for creating the Sustainability Index of the Presbyterian Mackenzie University."
      },
      {
        "id": "8",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Tagarela",
        "body": "Digital Validation Tool for Early Identification of Language Deficits in Children.",
        "description": "Digital Validation Tool for Early Identification of Language Deficits in Children."
      },
      {
        "id": "9",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Force Platform",
        "body": "Evaluation of human postural balance through a force platform.",
        "description": "Evaluation of human postural balance through a force platform."
      },
      {
        "id": "10",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Mackenzie volunteer",
        "body": "A web platform for Mackenzie Voluntário aimed at registering projects and participants of social actions.",
        "description": "A web platform for Mackenzie Voluntário aimed at registering projects and participants of social actions."
      },
      {
        "id": "11",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Latin Project",
        "body": "A platform for the free distribution of e-books created by local teachers and authors in Latin America.",
        "description": "A platform for the free distribution of e-books created by local teachers and authors in Latin America."
      },
      {
        "id": "12",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "Completed",
        "title": "Onboard Computer",
        "body": "Application for controlling the Electric Car, an ultra-efficient prototype powered by electricity developed by the Mackenzie School of Engineering.",
        "description": "Application for controlling the Electric Car, an ultra-efficient prototype powered by electricity developed by the Mackenzie School of Engineering."
      },
      {
        "id": "13",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Atlas",
        "body": "The Americas Atlas is a digital initiative aimed at providing a centralized and reliable resource for information related to border laws and regulations across the American continent. This website is specially designed to meet the needs of professionals working in border services, offering easy access to updated and relevant data for border management and immigration processes.",
        "description": "The Americas Atlas is a digital initiative aimed at providing a centralized and reliable resource for information related to border laws and regulations across the American continent."
      },
      {
        "id": "14",
        "img": "/code.jpeg",
        "date": "January 10, 2023",
        "status": "In Progress",
        "title": "Dashboard - Eletric Car",
        "body": "The electric car is a UPM project involving students from various courses at the School of Engineering. It consists of manufacturing a car that achieves energy efficiency, using techniques and knowledge from the fields of mechanics, electrical engineering, electronics, programming, among others. The objective is participation in the Shell Eco-marathon, a global academic program focused on energy efficiency and one of the world's premier engineering student competitions. In addition to the mechanical and electrical structure, the car uses sensors to monitor current and voltage consumption, temperature, and vehicle speed. These data are displayed on a panel; an application developed for a smartphone is fixed to the car's steering wheel so that the driver can monitor the vehicle's performance according to their actions. All communication between the Arduino and the application is done via USB cable, using the UART (Universal Asynchronous Receiver-Transmitter) serial protocol. Sensor data, after processing, are packaged into a JSON-formatted string and sent to the application, which receives this string and displays the values.",
        "description": "It consists of manufacturing a car that achieves energy efficiency, using techniques and knowledge from the fields of mechanics, electrical engineering, electronics, programming, among others."
      }
    ]
  },

  "contact": {
    "title": "Contact Us",
    "subtitle": "How can we help you?",
    "name": "Enter your name",
    "email": "Enter your e-mail address",
    "message": "Have a question?",
    "submitButton": "Submit"
  },

  "relacionados": {
    "title": "Read More",
    "related": [
      {
        "img": "/cloud.jpeg",
        "title": "Weather Station",
        "description": "Application that communicates with a weather station and its sensors, collecting and manipulating real-time weather data."
      },
      {
        "img": "/minimalist_setup.jpeg",
        "title": "Mackleaps Website",
        "description": "Aims to disseminate research and projects related to technology and recruit potential members and partners."
      },
      {
        "img": "/camera.jpeg",
        "title": "People Counter",
        "description": "Aims to count the number of people entering buildings on the Higienópolis campus of Mackenzie University."
      }
    ]
  }
}
